app/views/posts/index.html.erb

</div>
<% Post.all.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')